# CutLineType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CutMarkType..::..CutLineType Property
CutMarkType Class See Also
---
The cut line type of the cut mark.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public CutLineType CutLineType { get; set; }
```

Visual Basic
---
```text
Public Property CutLineType As CutLineType
	Get
	Set
```

Visual C++
---
```text
public:
property CutLineType CutLineType {
	CutLineType get ();
	void set (CutLineType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
CutMarkType Class
Autodesk.Revit.DB.Architecture Namespace